OdGeEntity3d.isOn(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified point is on this entity,
as determined by the tolerance.
\param point [in]  Point to be queried.
\param tol [in]  Geometric tolerance.

OdGeEntity3d.scaleBy(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales this entity by the scale factor about the basepoint, and returns
a reference to this entity.
\param scaleFactor [in]  Scale Factor. Must be greater than 0.
\param basePoint [in]  Basepoint.

OdGeEntity3d.mirror(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors this entity about the specified plane, and returns
a reference to this entity.
\param plane [in]  Plane about which entity is to be mirrored.

OdGeEntity3d.rotateBy(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Rotates this entity by the specified angle about the axis
defined by the point and the vector, and returns
a reference to this entity.
\param angle [in]  Rotation angle.
\param vect [in]  Vector about which entitiy is rotated.
\param basePoint [in]  Basepoint.

OdGeEntity3d.translateBy(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 3D translation vector to this entity, and returns
a reference to this entity.
\param translateVec [in]  Translation Vector.

OdGeEntity3d.transformBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 3D transformation matrix to this entity, and returns
a reference to this entity.
\param xfm [in]  3D transformation matrix.

OdGeEntity3d.isEqualTo(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified entity is equal to this one.
\param object [in]  Entity to be compared
\param tol    [in]  Geometric tolerance.
\returns
true if and only if both entities are of the same type, have the same point set within the
specified tolerance, and have the same parameterization.

OdGeEntity3d.op_Inequality(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity3d object.
\param entity [in]  Other entity to compare.
\returns
A boolean value that indicates whether the input entity is not identical to this entity.

OdGeEntity3d.op_Equality(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity3d object.
\param entity [in]  Other entity to compare.
\returns
A boolean value that indicates whether the input entity is identical to this entity.

OdGeEntity3d.op_Assign(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the OdGeEntity3d object.
\param entity [in]  Entity to assign.
\returns
A reference to this OdGeEntity3d object.

OdGeEntity3d.copy
\details
Returns a copy of this entity.
\remarks
The returned object is created with the new operator, and it is the responsibility of the caller to delete it.

OdGeEntity3d.type
\details
Returns the entity type.

OdGeEntity3d.isKindOf(OdGe.EntityId)
\details
Returns true if and only if this entity is of type (or is derived from) entType.
\param entType [in]  Entity type to test.

OdGeEntity3d.Dispose
\details
Destructor for the OdGeEntity3d class.